### Forest: Mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.mainnet.data.digitalocean_project.forest_project: Reading...
module.mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.mainnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.mainnet.digitalocean_droplet.forest: Refreshing state... [id=373118725]
module.mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=d6f6ba3a-d071-4c03-a90c-09d5e7da3c28]
module.mainnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.mainnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-09-04T07:49:10Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "373118725" -> (known after apply)
      ~ ipv4_address         = "161.35.70.163" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.9" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-mainnet"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:373118725" -> (known after apply)
      ~ user_data            = "7c733e6c46db5906e5073541a3845cb0df73c9ee" -> "841d26f08d0c205c624d70a4dfd09b60fabbe114" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 373118725,
        ] -> (known after apply)
        id              = "d6f6ba3a-d071-4c03-a90c-09d5e7da3c28"
        name            = "forest-mainnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:373118725",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>